 Функционал: Понимание языка Gherkin
    Как правильный 1С разработчик
    Я Хочу научится понимать все языковые конструкции языка
    Чтобы свзяать требования с ожидаемым поведением системы 

Контекст:
    Дано у меня есть VS Code
    И я скачал VB
    И я посмотрел видос


Сценарий: я пишу простой сценарий сложения двух чисел
    Когда у меня есть перове слагаемое 2
    И второе слогаемое 3
    Тогда я получу сумму 5

Структура сценария:
    Когда у меня есть перове слагаемое <ПервоеСлагаемое>
    И второе слогаемое <ВтороеСлагаемое>
    Тогда я получу сумму <Сумма>

    Примеры:
        | ПервоеСлагаемое | ВтороеСлагаемое | Сумма |
        | 2               | 3               | 5     |
        | 20              | 30              | 50    |
        | 200             | 300             | 5555  |        